app/controllers/account_activations_controller.rb

  	def edit
    	user = User.find_by(email: params[:email])
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'ducnd2495@gmail.com' LIMIT 1