app/controllers/password_resets_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'ducnd2495@gmail.com' LIMIT 1
---
  def create
    @user = User.find_by(email: params[:password_reset][:email].downcase)

UPDATE `users` SET `password_digest` = '$2a$10$n3dIDUBIEW/ocz4ocR5G2.WhA4hAe4QEWi4hLlQW1k9FRZSbpKrxy', `updated_at` = '2017-10-11 13:04:00' WHERE `users`.`id` = 1
---
  def update
    if params[:user][:password].empty?                  # Case (3)
      @user.errors.add(:password, "空にすることはできません")
      render 'edit'
    elsif @user.update_attributes(user_params)          # Case (4)