app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
    def show
        @user = User.find_by(id: params[:id])

INSERT INTO `users` (`email`, `name`, `created_at`, `updated_at`, `password_digest`, `activation_digest`) VALUES ('ducnd2495@gmail.com', 'Nguyen Dinh Duc', '2017-10-11 10:57:10', '2017-10-11 10:57:10', '$2a$10$k.QonbdGiOyZveyBGpg.KOOc2b9ng7KoFwUH6uW63YQloBZmarKBy', '$2a$10$2J2WVqtzEeMYpMgkDga.NupPcqlcOcZHDlMVRx1CX/pgn.C.zE5Ku')
---
    def create
        @user = User.new(user_params)
        if @user.save